In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib as mlt

In [6]:
df=pd.read_csv("http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv")
df.head(7)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285

In [7]:
df.tail(5)

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [9]:
df['rank'].dtype

dtype('O')

In [10]:
df['service'].dtype

dtype('int64')

In [11]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [12]:
df.ndim

2

In [13]:
df.size

468

In [15]:
df.shape

(78, 6)

In [17]:
df['rank'].values

array(['Prof', 'Prof', 'Prof', 'Prof', 'Prof', 'Prof', 'AssocProf',
       'Prof', 'Prof', 'Prof', 'Prof', 'Prof', 'AsstProf', 'Prof', 'Prof',
       'Prof', 'AsstProf', 'AsstProf', 'Prof', 'Prof', 'AsstProf', 'Prof',
       'AsstProf', 'AsstProf', 'Prof', 'Prof', 'Prof', 'Prof', 'AsstProf',
       'Prof', 'AssocProf', 'Prof', 'Prof', 'Prof', 'AssocProf', 'Prof',
       'Prof', 'Prof', 'AsstProf', 'Prof', 'Prof', 'AssocProf',
       'AsstProf', 'AsstProf', 'Prof', 'Prof', 'AsstProf', 'AssocProf',
       'Prof', 'Prof', 'AsstProf', 'Prof', 'Prof', 'AsstProf',
       'AssocProf', 'AsstProf', 'AssocProf', 'AsstProf', 'Prof',
       'AssocProf', 'AsstProf', 'AssocProf', 'AssocProf', 'Prof',
       'AssocProf', 'Prof', 'AsstProf', 'Prof', 'AsstProf', 'Prof',
       'AsstProf', 'AssocProf', 'Prof', 'Prof', 'AssocProf', 'Prof',
       'Prof', 'Prof'], dtype=object)

In [19]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [20]:
df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [21]:
df.mean()

C:\Users\Meenal Patel\AppData\Local\Temp\ipykernel_13356\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [22]:
df.std()

C:\Users\Meenal Patel\AppData\Local\Temp\ipykernel_13356\3390915376.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [25]:
df.sample(5)

         rank discipline  phd  service     sex  salary
6   AssocProf          A   20       17    Male   81285
18       Prof          A   19        7    Male  107300
38   AsstProf          B    4        3    Male   91000
5        Prof          A   20       20    Male  122400
52       Prof          A   12        0  Female  105000

In [24]:
df.dropna()

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [27]:
df.isna().sum()

rank          0
discipline    0
phd           0
service       0
sex           0
salary        0
dtype: int64

In [28]:
df.rank

<bound method NDFrame.rank of          rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]>

In [29]:
# Find how many records this data frame has?

In [39]:
df.shape

(78, 6)

In [30]:
# How many columns are there?

In [40]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [31]:
# What are the column names?

In [41]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [32]:
# What typesof columns we have in this data frame?

In [43]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [44]:
# Give the summary for the numeric columns in the dataset

In [47]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [45]:
# Calculate std dev. for all the numeric columns

In [59]:
df.std(numeric_only=True)

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [50]:
# What are the mean vaues of the first 50 records in the dataset?

In [61]:
dff=df.head(50)

In [66]:
dff.mean(numeric_only=True)

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [67]:
dff.mean(numeric_only=True,axis=1)

0     62355.000000
1     31006.000000
2     36852.666667
3     43758.666667
4     34946.000000
5     40813.333333
6     27107.333333
7     42112.000000
8     31466.000000
9     19300.666667
10    42774.000000
11    44941.333333
12    29333.666667
13    54089.333333
14    51264.666667
15    50166.666667
16    25018.333333
17    30668.000000
18    35775.333333
19    50185.333333
20    30669.333333
21    34389.666667
22    24335.333333
23    28334.000000
24    30384.333333
25    33161.333333
26    49602.333333
27    51984.333333
28    30436.333333
29    41241.333333
30    35674.666667
31    51931.000000
32    34440.333333
33    40012.000000
34    39940.000000
35    42328.000000
36    48982.000000
37    34009.333333
38    30335.666667
39    43012.000000
40    45691.666667
41    24950.333333
42    26743.666667
43    25668.333333
44    50603.333333
45    46715.333333
46    24902.000000
47    34545.000000
48    37182.000000
49    40998.333333
dtype: float64

In [70]:
df['Row_Mean']=(df['phd']+df['service']+df['salary'])/3
df.head()

   rank discipline  phd  service   sex  salary      Row_Mean
0  Prof          B   56       49  Male  186960  62355.000000
1  Prof          A   12        6  Male   93000  31006.000000
2  Prof          A   23       20  Male  110515  36852.666667
3  Prof          A   40       31  Male  131205  43758.666667
4  Prof          B   20       18  Male  104800  34946.000000

In [75]:
df=df[['phd','service','salary']]
df.head()

   phd  service  salary
0   56       49  186960
1   12        6   93000
2   23       20  110515
3   40       31  131205
4   20       18  104800

In [ ]:
# Calculate the basic sta